ID DIVISION.
PROGRAM ID. COMPRSON.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 99.
01 WS-B PIC 99.
01 WS-C PIC 99.
PROCEDURE DIVISION.
    ACCEPT WS-A.
    ACCEPT WS-B.
    ACCEPT WS-C.
    IF ((WS-A = WS-B) AND (WS-B = WS-C))
      DISPLAY 'ALL ARE EQUAL'
    END-IF
    IF (WS-A > WS-C)
      IF(WS-A > WS-B)
         DISPLAY 'A IS BIGGER THAN B AND C'
      END-IF
    END-IF
    IF (WS-B > WS-A)
      IF(WS-B > WS-C)
         DISPLAY 'B IS BIGGER THAN A AND C'
      END-IF
    END-IF 
    IF (WS-C > WS-A)
      IF (WS-C > WS-B)
         DISPLAY ' C IS BIGGER THAN A AND B'
      END-IF
    END-IF
    IF (WS-A > WS-B) 
       IF (WS-B > WS-C)
         DISPLAY 'A AND B ARE BIGGER'
       END-IF
    END-IF
    IF ( WS-A > WS-B)
      IF ( WS-C > WS-B)
         DISPLAY 'A AND C ARE BIGGER'
      END-IF
    END-IF
    IF ( WS-B > WS-A)
      IF ( WS-C > WS-A)
          DISPLAY 'B AND C ARE BIGGER'
      END-IF
    END-IF
    STOP RUN.