       IDENTIFICATION DIVISION.
       PROGRAM-ID. Tarun_cobolchellange_23.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 WS-AMARK PIC 99.
       01 WS-COUNT PIC 9.
       01 WS-DATA.
         02 WS-IMARK VALUES 01020304057055758045.
            05 WS-I OCCURS 5 TIMES INDEXED BY I.
               10 WS-I1 PIC 99. 
            05 WS-MARK OCCURS 5 TIMES INDEXED BY J.
               10 WS-SCORE1 PIC 99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
        DISPLAY 'ENTER THE MARK'
        ACCEPT WS-AMARK.
        SET J TO 1
        DISPLAY 'NUMBER OF STUDENTS WHO SCORED MORE THAN ' WS-AMARK
        PERFORM PARA-1 5 TIMES
        DISPLAY WS-COUNT.
       STOP RUN.
       PARA-1.
       IF(WS-AMARK < WS-MARK(J)) THEN
           ADD 1 TO WS-COUNT
       END-IF
       SET J UP BY 1.