IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TEXT PIC X(15) OCCURS 5 TIMES INDEXED BY IND.
01 WS-TEXT1 PIC X(26) OCCURS 5 TIMES INDEXED BY IND2.
01 I PIC 9.
01 WS-CNTR PIC 9.
PROCEDURE DIVISION.
PERFORM VARYING I FROM 1 BY 1 UNTIL I>5 
SET IND TO 1
ACCEPT  WS-TEXT(IND)
UNSTRING WS-TEXT(IND) DELIMITED BY '.' INTO WS-TEXT1(IND2) COUNT IN WS-CNTR 
DISPLAY WS-TEXT(IND) WS-CNTR
SET IND UP BY 1
END-PERFORM.
STOP RUN.