IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TXT PIC X(255).
01 WS-NEW-TXT PIC X(255).
01 I PIC 99.
01 LEN PIC 99.
PROCEDURE DIVISION.
ACCEPT WS-TXT.
COMPUTE LEN = FUNCTION LENGTH(WS-TXT).
MOVE FUNCTION LOWER-CASE(WS-TXT) TO WS-TXT.
MOVE FUNCTION UPPER-CASE(WS-TXT(1:1)) TO WS-TXT(1:1).
PERFORM VARYING I FROM 1 BY 1 UNTIL I>LEN
IF WS-TXT(I:1) = ' '
ADD 1 TO I
MOVE FUNCTION UPPER-CASE(WS-TXT(I:1)) TO WS-NEW-TXT(I:1)
ELSE
MOVE WS-TXT(I:1) TO WS-NEW-TXT(I:1)
END-IF
END-PERFORM.
DISPLAY WS-NEW-TXT.
STOP RUN.