IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-I PIC X(03).
88 MON VALUE 'MON'.
88 MON VALUE 'TUE'.
88 MON VALUE 'WED'.
88 MON VALUE 'THU'.
88 MON VALUE 'FRI'.
88 MON VALUE 'SAT'.
88 MON VALUE 'SUN'.
PROCEDURE DIVISION.
DISPLAY 'DAY SPECILITY'.
ACCEPT WS-I.
EVALUATE TRUE
    WHEN WS-I EQUAL 'MON'
       DISPLAY 'MON IS WORKING DAY'
    WHEN WS-I EQUAL 'TUE'
       DISPLAY 'TUE IS WORKING DAY'
    WHEN WS-I EQUAL 'WED'
       DISPLAY 'WED IS WORKING DAY'
    WHEN WS-I EQUAL 'THU'
       DISPLAY 'THU IS WORKING DAY'
    WHEN WS-I EQUAL 'FRI'
       DISPLAY 'FRI IS WORKING DAY'
    WHEN WS-I EQUAL 'SAT'
       DISPLAY 'SAT IS HOLIDAY'
    WHEN WS-I EQUAL 'SUN'
       DISPLAY 'SUN IS HOLIDAY'
    WHEN OTHER
       DISPLAY 'INVALID DAY ENTRY'   
END-EVALUATE.       
STOP RUN.