IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(2).
01 B PIC 9(2).
01 C PIC 9(2).
PROCEDURE DIVISION.
ACCEPT A.
ACCEPT B.
ACCEPT C.
IF A=B AND B=C AND C=A 
DISPLAY 'ALL ARE EQUAL'
ELSE IF A>C AND B>C
DISPLAY 'A AND B ARE BIGGER'
ELSE IF A>B AND C>B
DISPLAY 'A AND C ARE BIGGER'
ELSE IF B>A AND C>A
DISPLAY 'B AND C ARE BIGGER'
ELSE IF A>B AND A>C
DISPLAY 'A IS BIGGER'
ELSE IF B>C AND B>A
DISPLAY 'B IS BIGGER'
ELSE IF C>A AND C>B
DISPLAY 'C IS BIGGER'
END-IF.
STOP RUN.