IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC X(15) OCCURS 5 TIMES INDEXED BY IND.
01 NAME1 PIC X(15) OCCURS 5 TIMES INDEXED BY IND1.
01 I PIC 9.
PROCEDURE DIVISION.
PERFORM VARYING I FROM 1 BY 1 UNTIL I>=5 
SET IND TO 1
ACCEPT  NAME(IND)
PERFORM B-PARA
SET IND UP BY 1
END-PERFORM.
B-PARA.
SET IND1 TO IND.
MOVE FUNCTION UPPER-CASE(NAME(IND))(1:1) TO NAME1(IND1)(1:1)
MOVE FUNCTION LOWER-CASE(NAME(IND))(2:14) TO NAME1(IND1)(2:14)
IF NAME1(IND1)(1:1)='A'
DISPLAY NAME1(IND1).
STOP-RUN.