IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-DAY PIC X(3).
88 WORKING VALUE 'MON' 'TUE' 'WED' 'THU' 'FRI'.
88 HOLIDAY VALUE 'SAT' 'SUN'.
PROCEDURE DIVISION.
ACCEPT WS-DAY.
IF WORKING
DISPLAY 'WORKING'
ELSE IF HOLIDAY
DISPLAY 'HOLIDAY'
ELSE 
DISPLAY 'NONE'
END-IF.
EVALUATE WS-DAY
WHEN 'MON'
WHEN 'TUE'
WHEN 'WED'
WHEN 'THU'
WHEN 'FRI'
DISPLAY 'WORKING'
WHEN 'SAT'
WHEN 'SUN'
DISPLAY 'HOLIDAY'
WHEN OTHER
DISPLAY 'NONE'
END-EVALUATE.
STOP-RUN.