IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 ARR OCCURS 5 TIMES PIC S9(2).
        77 I PIC 9 VALUE 0.
        77 J PIC 9 VALUE 1.
        77 K PIC 9 VALUE 0 .
        77 L PIC 9 VALUE 5.
PROCEDURE DIVISION.
   DISPLAY "ENTER 5 NUMBERS:"
   PERFORM UNTIL I = L
   ADD 1 TO I
   ACCEPT ARR(I)
   END-PERFORM.
   MOVE 1 TO I.
   PERFORM UNTIL I > L
   MOVE I TO J
    PERFORM UNTIL J > L
      IF (ARR(I) = ARR(J))
         MOVE J TO K
         PERFORM UNTIL K > L
           MOVE  ARR(K) TO ARR(K+1) 
            ADD 1 TO K GIVING K
         END-PERFORM
         SUBTRACT 1 FROM L
         SUBTRACT 1 FROM J
      END-IF
     ADD 1 TO J GIVING J
    END-PERFORM
    ADD 1 TO I GIVING I
    END-PERFORM.
  MOVE 0 TO I.
  PERFORM UNTIL I = L
  ADD 1 TO I
  DISPLAY I "=" ARR(I)
  END-PERFORM.
   
   
STOP RUN.
