1) TOTAL COUNT AND MARKS OF MALE AND FEMALE
      

       IDENTIFICATION DIVISION.
       PROGRAM-ID. MARKS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STDFILE
           ASSIGN TO 'C:\Users\Manipal\Desktop\COBOL\mark.txt'
           ORGANISATION IS LINE SEQUENTIAL
           FILE STATUS IS WS-STAT.
       DATA DIVISION.
       FILE SECTION.
       FD STDFILE.
       01 STD-REC.
           05     STUD-ID PIC 99.
           05     STUD-GENDER PIC X.
               88 VALIDG VALUE 'M' 'F'.
           05  STUD-MARKS PIC 999.
       WORKING-STORAGE SECTION.SS
       77 WS-STAT        PIC 99. 
       77 WS-MC            PIC 99   VALUE ZERO.
       77 WS-FC             PIC 99   VALUE ZERO.
       77 WS-MMARKS  PIC 999 VALUE ZERO.
       77 WS-FMARKS   PIC 999 VALUE ZERO.
       77 WS-MARK        PIC 999 VALUE ZERO.
       77 WS-SMARK      PIC 999 VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           OPEN INPUT STDFILE
           IF WS-STAT = '00' THEN
               PERFORM READ-PARA THRU READ-EXIT
               PERFORM CLOSE-PARA
           END-IF
           DISPLAY "MALES - " WS-MC " Total marks scored - " WS-MMARKS
           DISPLAY "FEMALES - "WS-FC " Total marks scored - " WS-FMARKS
            STOP RUN.
       READ-PARA.
           PERFORM UNTIL WS-STAT NOT = 00
           READ STDFILE
           END-READ
           IF (WS-STAT NOT = 10) THEN
           PERFORM PROCEDURE-PARA
           END-IF
           END-PERFORM.
       READ-EXIT.
           EXIT.
       PROCEDURE-PARA.
           IF ( STUD-GENDER = 'M') THEN
               ADD 1 TO WS-MC
               MOVE WS-MMARKS TO WS-MARK
               MOVE STUD-MARKS TO WS-SMARK
               ADD WS-SMARK TO WS-MARK GIVING WS-MMARKS
           ELSE
               IF( STUD-GENDER = 'F') THEN
                   ADD 1 TO WS-FC
                   MOVE WS-FMARKS TO WS-MARK
                   MOVE STUD-MARKS TO WS-SMARK
                   ADD WS-SMARK TO WS-MARK GIVING WS-FMARKS
               ELSE
                   DISPLAY "INAVALID GENDER"
               END-IF
           END-IF.

       CLOSE-PARA.
           CLOSE STDFILE.
       END PROGRAM MARKS.


       
2) MONTH SERIES AND EMPLOYEE

       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPFILE
           ASSIGN TO 'C:\Users\Manipal\Desktop\COBOL\num.txt'
           ORGANISATION IS LINE SEQUENTIAL
           FILE STATUS IS WS-STAT.
       DATA DIVISION.
       FILE SECTION.
       FD EMPFILE.
       01 EMP-REC.
           05 EMP-ID  PIC 999.
           05 EMP-DOB PIC X(6).
       WORKING-STORAGE SECTION.
       01 WS-NUMOFEMP.
           05 WS-MON OCCURS 12 TIMES PIC 9(2).
           05 WS-NUM OCCURS 12 TIMES PIC 9(2) VALUE ZERO.
       77 WS-STAT PIC 99.
       77 WS-MM PIC 99.
       77 WS-I PIC 99 VALUE ZERO.
       77 WS-EX PIC 99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            OPEN INPUT EMPFILE
            IF ( WS-STAT = 00 ) THEN
                PERFORM READ-PARA
                PERFORM CLOSE-PARA
            END-IF
            DISPLAY "MONTH          NUM OF EMPLOYEE"
            PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I >12
            DISPLAY WS-MON(WS-I) "             " WS-NUM(WS-I)
            END-PERFORM
            STOP RUN.
       READ-PARA.
          PERFORM UNTIL WS-STAT NOT = 00
           READ EMPFILE
           END-READ
           IF (WS-STAT NOT = 10) THEN
           PERFORM PROCEDURE-PARA
           END-IF
           END-PERFORM.
       PROCEDURE-PARA.
           PERFORM VARYING WS-I FROM 01 BY 1 UNTIL WS-I > 12
             MOVE WS-I TO WS-MON(WS-I)
           END-PERFORM
           MOVE EMP-DOB(3:2) TO WS-MM
           EVALUATE WS-MM
               WHEN WS-MM
                 MOVE WS-NUM(WS-MM) TO WS-EX
                 ADD 1 TO WS-EX GIVING WS-NUM(WS-MM)
               WHEN OTHER
                 DISPLAY "INVALID MONTH"
           END-EVALUATE.
       CLOSE-PARA.
           CLOSE EMPFILE.
       END PROGRAM NUM.


3)MONTH NAME AND EMPLOYEE


       IDENTIFICATION DIVISION.
       PROGRAM-ID. NAME.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPFILE
           ASSIGN TO 'C:\Users\Manipal\Desktop\COBOL\month.txt'
           ORGANISATION IS LINE SEQUENTIAL
           FILE STATUS IS WS-STAT.
       DATA DIVISION.
       FILE SECTION.
       FD EMPFILE.
       01 EMP-REC.
           05 EMP-ID  PIC 999.
           05 EMP-DOB PIC X(6).
       WORKING-STORAGE SECTION.
       01 WS-NUMOFEMP.
           05 WS-MON OCCURS 12 TIMES PIC X(3).
           05 WS-NUM OCCURS 12 TIMES PIC 9(2) VALUE ZERO.
       77 WS-STAT PIC 99.
       77 WS-MM PIC 99.
       77 WS-I PIC 99 VALUE ZERO.
       77 WS-EX PIC 99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            OPEN INPUT EMPFILE
            IF ( WS-STAT = 00 ) THEN
                PERFORM READ-PARA
                PERFORM CLOSE-PARA
            END-IF
            DISPLAY "MONTH          NUM OF EMPLOYEE"
            PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I >12
            DISPLAY WS-MON(WS-I) "             " WS-NUM(WS-I)
            END-PERFORM
            STOP RUN.
       READ-PARA.
          PERFORM UNTIL WS-STAT NOT = 00
           READ EMPFILE
           END-READ
           IF (WS-STAT NOT = 10) THEN
           PERFORM PROCEDURE-PARA
           END-IF
           END-PERFORM.
       PROCEDURE-PARA.
           PERFORM VARYING WS-I FROM 01 BY 1 UNTIL WS-I > 12
             EVALUATE TRUE
             WHEN WS-I = 01
                MOVE "JAN" TO WS-MON(WS-I)
             WHEN WS-I = 02
                MOVE "FEB" TO WS-MON(WS-I)
             WHEN WS-I = 03
                MOVE "MAR" TO WS-MON(WS-I)
             WHEN WS-I = 04
                MOVE "APR" TO WS-MON(WS-I)
             WHEN WS-I = 05
                MOVE "MAY" TO WS-MON(WS-I)
             WHEN WS-I = 06
                MOVE "JUN" TO WS-MON(WS-I)
             WHEN WS-I = 07
                MOVE "JUL" TO WS-MON(WS-I)
             WHEN WS-I = 08
                MOVE "AUG" TO WS-MON(WS-I)
             WHEN WS-I = 09
                MOVE "SEP" TO WS-MON(WS-I)
             WHEN WS-I = 10
                MOVE "OCT" TO WS-MON(WS-I)
             WHEN WS-I = 11
                MOVE "NOV" TO WS-MON(WS-I)
             WHEN WS-I = 12
                MOVE "DEC" TO WS-MON(WS-I)
             END-EVALUATE
           END-PERFORM
           MOVE EMP-DOB(3:2) TO WS-MM
           EVALUATE WS-MM
               WHEN WS-MM
                 MOVE WS-NUM(WS-MM) TO WS-EX
                 ADD 1 TO WS-EX GIVING WS-NUM(WS-MM)
               WHEN OTHER
                 DISPLAY "INVALID MONTH"
           END-EVALUATE.
       CLOSE-PARA.
           CLOSE EMPFILE.
       END PROGRAM NAME.