IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
    77 SHIRTCOST PIC 9(2) VALUE 15.
    77 SAREECOST PIC 9(2) VALUE 10
    77 OTHCOST   PIC 9(1) VALUE 5.
    01 NOOFSHIRTS    PIC 9(3).
    01 NOOFSAREES    PIC 9(3).
    01 OTHITEMS      PIC 9(3).
    01 TOTSHIRTS     PIC 9(5).
    01 TOTSAREES     PIC 9(5).
    01 TOTOTHS       PIC 9(5).
    01 TOTALLOW      PIC 9(5).
    
PROCEDURE DIVISION.
    ACCEPT NOOFSHIRTS.
    ACCEPT NOOFSAREES.
    ACCEPT OTHITEMS.
    COMPUTE TOTSHIRTS = NOOFSHIRTS * SHIRTCOST.
    COMPUTE TOTSAREES = NOOFSAREES * SAREECOST.
    COMPUTE TOTOTHS =  OTHITEMS *  OTHCOST .
    COMPUTE TOTALLOW = TOTSHIRTS+TOTSAREES+TOTOTHS.
    DISPLAY TOTALLOW.
    
STOP RUN.