IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WEEK-DAY PIC X(03).
       88 MON VALUE 'MON'.
       88 TUE VALUE 'TUE'.
       88 WED VALUE 'WED'.
       88 THUR VALUE 'THUR'.
       88 FRI VALUE 'FRI'.
       88 SAT VALUE 'SAT'.
       88 SUN VALUE 'SUN'.
PROCEDURE DIVISION.
    ACCEPT WEEK-DAY.
    EVALUATE WEEK-DAY
        WHEN 'MON'
            DISPLAY 'MONDAY IS WORKING DAY'
        WHEN 'TUE'
            DISPLAY 'TUESDAY IS WORKING DAY'
        WHEN 'WED'
            DISPLAY 'WEDNESDAY IS WORKING DAY'
        WHEN 'THUR'
            DISPLAY 'THURSDAY IS WORKING DAY'
        WHEN 'FRI'
            DISPLAY 'FRIDAY IS WORKING DAY'
        WHEN 'SAT'
            DISPLAY 'SATURDAY IS HOLIDAY'
        WHEN 'SUN'
            DISPLAY 'SUNDAY IS HOLIDAY'
    END-EVALUATE. 
STOP RUN.
