IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9.
01 RESULT PIC 9(3).
PROCEDURE DIVISION.
ACCEPT  N.
COMPUTE RESULT = N + (N * 10 + N) + (N * 100 + N * 10 + N).
DISPLAY RESULT.
STOP-RUN.