IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-SENTENCE PIC X(102).
01 WS-PATTERN PIC X(6).
01 WS-CNTR PIC 99 VALUE 0.
PROCEDURE DIVISION.
ACCEPT WS-SENTENCE.
ACCEPT WS-PATTERN.
INSPECT WS-SENTENCE TALLYING WS-CNTR FOR ALL WS-PATTERN.
DISPLAY WS-CNTR.
STOP RUN.