IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STRNG PIC X(26) VALUE 'Sweeter grapes hang higher'.
01 WS-REVERSE-STRNG PIC X(26).
01 L PIC 99 VALUE 26.
PROCEDURE DIVISION.
PERFORM VARYING L FROM 1 BY 1 UNTIL L>26
MOVE WS-STRNG(L:1) TO WS-REVERSE-STRNG(26 - L : 1)
END-PERFORM.
DISPLAY WS-REVERSE-STRNG.
STOP RUN.