IDENTIFICATION DIVISION.
PROGRAM-ID. NUMBERS-PATTERN.

DATA DIVISION. 
WORKING-STORAGE SECTION.
01 WS-I PIC 9(2) VALUE 0.
01 WS-J PIC 9(2) VALUE 0.
01 WS-N PIC 9(2).
01 WS-OUT PIC 9(2).
01 WS-CENTER PIC 9(2) VALUE 1.
     
PROCEDURE DIVISION.
  DISPLAY "ENTER HOW MANY ROWS U WANT:".
  ACCEPT  WS-N.

PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I <= WS-N
     PERFORM VARYING WS-J FROM 1 BY 1 UNTIL WS-J <= WS-I
            MULTIPLY WS-I BY WS-J GIVING WS-OUT
            DISPLAY WS-OUT(WS-CENTER:WS-I)
            END-PERFORM
END-PERFORM
STOP RUN.
