IDENTIFICATION DIVISION.
PROGRAM-ID. NESTEDif.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(2).
01 B PIC 9(2).
01 C PIC 9(2).
    
PROCEDURE DIVISION.
    ACCEPT A.
    ACCEPT B.
    ACCEPT C.
  
    IF (A=B) AND (B=C)
    DISPLAY 'ALL ARE EQUAL'
    END-IF.
    IF(A>B AND A>C)
    DISPLAY 'A IS BIGGER'
    END-IF.
    IF(B>A AND B>C)
    DISPLAY 'B IS BIGGER'
    END-IF.
    IF(C>B AND C>A)
    DISPLAY 'C IS BIGGER'
    END-IF.
    IF(A>B AND B>C)
    DISPLAY 'A AND BIS BIGGER TAHN C'
    END-IF.
     IF(A>C AND C>B)
    DISPLAY 'A AND C IS BIGGER THAN B'
    END-IF.
    IF(C>B AND B>A)
    DISPLAY 'C AND B IS BIGGER THAN A'
    END-IF.
    
STOP RUN.
